{"class_name": "Model", "config": {"name": "model_16", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 1], "dtype": "float32", "sparse": false, "name": "input_23"}, "name": "input_23", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 32], "dtype": "float32", "sparse": false, "name": "input_24"}, "name": "input_24", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 32], "dtype": "float32", "sparse": false, "name": "input_25"}, "name": "input_25", "inbound_nodes": []}, {"class_name": "LSTM", "config": {"name": "decoder_lstm", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 32, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "name": "decoder_lstm", "inbound_nodes": [[["input_23", 0, 0, {}], ["input_24", 0, 0, {}], ["input_25", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "decoder_pre_output", "trainable": true, "dtype": "float32", "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "decoder_pre_output", "inbound_nodes": [[["decoder_lstm", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "decoder_dense", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "decoder_dense", "inbound_nodes": [[["decoder_pre_output", 0, 0, {}]]]}], "input_layers": [["input_23", 0, 0], ["input_24", 0, 0], ["input_25", 0, 0]], "output_layers": [["decoder_dense", 0, 0], ["decoder_lstm", 0, 1], ["decoder_lstm", 0, 2]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}